Repository: MLGRussianXP/ios-nis
Catalog: 09-oauth/cli-oauth21/*.lproj/Localizable.strings
Languages: ru

# navigation_title
source: OAuth 2.1 Demo
ru: OAuth 2.1 Демо

# oauth_flow_title
source: OAuth 2.1 Authentication Flow
ru: OAuth 2.1 Аутентификация

# alert_ok
source: OK
ru: ОК

# alert_error_title
source: Error
ru: Ошибка

# alert_success_title
source: Success
ru: Успех

# alert_logged_in
source: Logged in
ru: Вход выполнен

# alert_token_refreshed
source: Token refreshed
ru: Токен обновлен

# step1_title
source: Step 1: Enter Credentials
ru: Шаг 1: Введите учетные данные

# username_placeholder
source: Username
ru: Имя пользователя

# password_placeholder
source: Password
ru: Пароль

# step2_title
source: Step 2: Client Registration
ru: Шаг 2: Регистрация клиента

# step2_subtitle
source: Register this app as an OAuth client
ru: Зарегистрируйте приложение как OAuth-клиент

# step2_action
source: Register Client
ru: Зарегистрировать клиента

# step3_title
source: Step 3: User Registration
ru: Шаг 3: Регистрация пользователя

# step3_subtitle
source: Create a new user account
ru: Создать новую учетную запись

# step3_action
source: Register User
ru: Зарегистрировать пользователя

# step4_title
source: Step 4: Authentication
ru: Шаг 4: Аутентификация

# step4_subtitle
source: Complete OAuth 2.1 authentication flow
ru: Завершите OAuth 2.1 аутентификацию

# step4_action
source: Authenticate
ru: Аутентифицироваться

# reauth_title
source: Re-authenticate
ru: Повторный вход

# reauth_subtitle
source: Authenticate with existing user
ru: Войти с существующим пользователем

# reauth_action
source: Sign In
ru: Войти

# reset_action
source: Reset Flow
ru: Сбросить процесс

# reset_caption
source: This will clear all progress
ru: Это очистит весь прогресс

# profile_title
source: Profile
ru: Профиль

# profile_subtitle
source: Authenticated
ru: Аутентифицирован

# refresh_token_action
source: Refresh Token
ru: Обновить токен

# logout_action
source: Log Out
ru: Выйти

# loading_title
source: Processing...
ru: Выполняется...

# userinfo_title
source: User Information:
ru: Информация о пользователе:

# userinfo_id
source: User ID
ru: ID пользователя

# userinfo_username
source: Username
ru: Имя пользователя

# userinfo_updated
source: Last Updated
ru: Последнее обновление

# profile_username
source: Username
ru: Имя пользователя

# profile_updated
source: Last Updated
ru: Дата обновления

# token_expires_in
source: Expires in:
ru: Истекает через:

# token_remaining_hours_minutes
source: %d h %d min
ru: %d ч %d мин

# token_remaining_minutes_seconds
source: %d min %d sec
ru: %d мин %d сек

# na_value
source: N/A
ru: Н/Д

# error_invalid_url
source: Invalid server URL
ru: Некорректный URL сервера

# error_client_not_registered
source: Client not registered
ru: Клиент не зарегистрирован

# error_server_generic
source: Server error. Please try again.
ru: Ошибка сервера. Попробуйте снова.

# error_invalid_response
source: Invalid server response
ru: Некорректный ответ сервера

# error_not_authenticated
source: Not authenticated
ru: Не выполнен вход

# error_400
source: Invalid request. Check data.
ru: Некорректный запрос. Проверьте данные.

# error_401
source: Session expired. Log in again.
ru: Сессия истекла. Войдите снова.

# error_429
source: Too many attempts. Please wait.
ru: Слишком много попыток. Пожалуйста, подождите.

# error_network
source: No server connection.
ru: Нет соединения с сервером.
